In [132]:
import pandas as pd
from sqlalchemy import create_engine

### Import 1st CSV into pandas and create DataFrame

In [133]:
csv_file = "Resources/Players.csv"
nba_players_df = pd.read_csv(csv_file, index_col=0)
nba_players_df.head()
#nba_players_df.shape
#nba_players_df.loc[nba_players_df["Player"] == "LeBron James"]

,Player,height,weight,collage,born,birth_city,birth_state
0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky

### Create new DataFrame with select columns

In [134]:
nba_new_df = nba_players_df[["Player", "collage", "born", "birth_city", "birth_state"]]
nba_new_df.head()

,Player,collage,born,birth_city,birth_state
0,Curly Armstrong,Indiana University,1918.0,NaN,NaN
1,Cliff Barker,University of Kentucky,1921.0,Yorktown,Indiana
2,Leo Barnhorst,University of Notre Dame,1924.0,NaN,NaN
3,Ed Bartels,North Carolina State University,1925.0,NaN,NaN
4,Ralph Beard,University of Kentucky,1927.0,Hardinsburg,Kentucky

### Clean up df with correct format - all lowercase and update incorrect "collage" to "college"

In [137]:
nba_new_df.columns = ["player","college", "born", "birth_city", "birth_state"]
nba_new_df.head()
#nba_new_df.shape
#nba_new_df.columns

,player,college,born,birth_city,birth_state
0,Curly Armstrong,Indiana University,1918.0,NaN,NaN
1,Cliff Barker,University of Kentucky,1921.0,Yorktown,Indiana
2,Leo Barnhorst,University of Notre Dame,1924.0,NaN,NaN
3,Ed Bartels,North Carolina State University,1925.0,NaN,NaN
4,Ralph Beard,University of Kentucky,1927.0,Hardinsburg,Kentucky

In [ ]:
# nba_new_df = nba_new_df.dropna()
# nba_new_df.head()
#nba_new_df.loc[nba_new_df["Player"] == "Russell Westbrook"]
#nba_new_df.shape

### Import second CSV import to pandas and create a DataFrame

In [139]:
csv_file = "Resources/nba_2017_twitter_players.csv"
nba_twitter_df = pd.read_csv(csv_file)
nba_twitter_df.head()

              PLAYER  TWITTER_FAVORITE_COUNT  TWITTER_RETWEET_COUNT
0  Russell Westbrook                  2130.5                  559.0
1       James Harden                   969.0                  321.5
2      Isaiah Thomas                   467.5                  155.5
3      Anthony Davis                   368.0                  104.0
4      DeMar DeRozan                     0.0                  186.0

In [141]:
nba_twitter_df.columns = ["player","twitter_favorite_count", "twitter_retweet_count"]
nba_twitter_df.head()
#nba_twitter_df.shape
nba_twitter_df.columns

Index(['player', 'twitter_favorite_count', 'twitter_retweet_count'], dtype='object')

## 1st merge

In [ ]:
# nba_twitter_df = pd.merge(nba_new_df, nba_twitter_df, on="player")
# nba_twitter_df.head()
# #t1_nba_df.shape

## Create engine

In [142]:
from config import postgres_credentials as creds
rds_connection_string = f"{creds['user']}:{creds['pass']}@localhost:5432/ETL_Project_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [144]:
#engine.table_names()

In [145]:
# engine.execute('DELETE FROM players')
# engine.execute('DELETE FROM nba_twitter') 
# I was not able to connect after the merge. it kept pulling an error indicating 7 columns expected for twitter
# table (which only has 3). I cleared output, commented out the merge and it passed through. 

nba_new_df.to_sql(name="players", con=engine, if_exists="append", index=False)
nba_twitter_df.to_sql(name="nba_twitter", con=engine, if_exists="append", index=False)

In [147]:
pd.read_sql_query('SELECT * FROM players', con=engine).head()

,player,college,born,birth_city,birth_state
0,Curly Armstrong,Indiana University,1918.0,None,None
1,Cliff Barker,University of Kentucky,1921.0,Yorktown,Indiana
2,Leo Barnhorst,University of Notre Dame,1924.0,None,None
3,Ed Bartels,North Carolina State University,1925.0,None,None
4,Ralph Beard,University of Kentucky,1927.0,Hardinsburg,Kentucky

In [148]:
pd.read_sql_query('SELECT * FROM nba_twitter', con=engine).head()

              player  twitter_favorite_count  twitter_retweet_count
0  Russell Westbrook                  2130.5                  559.0
1       James Harden                   969.0                  321.5
2      Isaiah Thomas                   467.5                  155.5
3      Anthony Davis                   368.0                  104.0
4      DeMar DeRozan                     0.0                  186.0